{
  "backend/main.mo": "Main Motoko actor for the SafarX backend, implementing user profiles, travel inquiries (submit/get/delete/list), admin authentication (legacy principal-based and access-control mixin), and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the LinkedIn icon link was added to the Footer component, with test ID and affected file references.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's frontend structure and recent changes.",
  "frontend/.env.example": "Example environment variable file documenting the required VITE_GOOGLE_CLIENT_ID variable for Google OAuth 2.0 Sign-In integration.",
  "frontend/index.css": "Root CSS file that imports Tailwind layers and defines OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point with full SEO meta tags, Open Graph and Twitter Card fallbacks, sitemap link, Google Fonts, Google Sign-In script, and Google Analytics setup.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing them to the sitemap at https://safarx.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all core pages and individual destination URLs for safarx.in with last-modified dates, change frequencies, and priority values.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with two layout groups: a public layout (header + footer) for all standard routes, and a bare admin layout (no header/footer) for /admin and /admin/login.",
  "frontend/src/components/CommunityAuthModal.tsx": "A modal dialog component that handles community user authentication, supporting both login and registration forms as well as Google Identity Services OAuth sign-in.",
  "frontend/src/components/CommunityFeed.tsx": "Displays a paginated feed of community travel posts with like, delete, and expand functionality, rendering each post as a card with image, metadata, and author info.",
  "frontend/src/components/CommunityProfile.tsx": "Shows a logged-in user's profile page including their stats and a list of their own posts, each with a password-confirmed delete option.",
  "frontend/src/components/CreatePostModal.tsx": "A modal form for creating a new community travel post with fields for title, body, image URL, and destination, supporting both regular and Google-authenticated users.",
  "frontend/src/components/DestinationCard.tsx": "A linked card component that displays a travel destination's image, name, region, tags, and a short description, with hover animations and special badges for Gen-Z or Hill Station tags.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with brand info, social media links, region exploration links, quick navigation links, and contact details for SafarX.in.",
  "frontend/src/components/Header.tsx": "Fixed responsive navigation header with scroll-aware styling, logo, desktop nav links, and a mobile sheet drawer for SafarX.in (without admin link).",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the Header component that includes an additional Admin nav link pointing to /admin, otherwise identical in structure and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component accepting props for background image, headline, subheadline, and CTA buttons, with a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a timeline with day-by-day activity cards grouped by morning/afternoon/evening, plus a summary header with trip metadata.",
  "frontend/src/components/PackageCard.tsx": "Card component for displaying a travel package with image, category badge, duration, price, destinations, description, and top highlights.",
  "frontend/src/data/destinations.ts": "Defines the `Destination` and `Region` TypeScript types and exports a large static array of Indian travel destinations with details like description, highlights, best time to visit, and images.",
  "frontend/src/data/packages.ts": "Defines the `TravelPackage` TypeScript interface and exports a static array of curated Indian travel packages with duration, destinations, price ranges, and highlights.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend interactions including inquiry CRUD, community stats, and admin authentication (register, login, session management) using a localStorage-based session token.",
  "frontend/src/hooks/useSEO.ts": "Custom React hook that dynamically updates the document title, meta description, Open Graph, and Twitter Card tags on mount and restores previous values on cleanup.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind layers and defines a warm earthy CSS custom-property theme (SafarX palette) for both light and dark modes, plus utility classes for typography, hero overlays, card hover effects, and gradients.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and a custom InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Protected admin dashboard page that displays, searches, sorts, and deletes travel inquiries, and shows community stats and user lists, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, integrating Internet Identity for registration and storing a session token on success before redirecting to the dashboard.",
  "frontend/src/pages/Community.tsx": "Community hub page with a hero banner and tabbed interface for a travel-story feed and user profile, gating authenticated actions behind a CommunityAuthModal.",
  "frontend/src/pages/Contact.tsx": "Contact page with a travel inquiry form that submits name, email, phone, destination, and message to the backend via useSubmitInquiry, showing a success state on completion.",
  "frontend/src/pages/DestinationDetail.tsx": "Renders a detailed page for a single destination, showing a hero image, badges, description, highlights, and travel tips, with SEO metadata and a 404 fallback if the destination is not found.",
  "frontend/src/pages/Destinations.tsx": "Displays a filterable, searchable grid of all destinations grouped by region, with SEO metadata and BreadcrumbList JSON-LD structured data injected on mount.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with a hero section, stats bar, featured destinations, and a 'why choose us' section, along with SEO metadata and TravelAgency JSON-LD structured data.",
  "frontend/src/pages/Packages.tsx": "Displays a category-filterable list of curated travel packages with a hero banner, SEO metadata, and BreadcrumbList JSON-LD structured data.",
  "frontend/src/pages/PlanTrip.tsx": "Provides an AI-powered trip planner form where users select a destination, duration, travel style, and group type to generate a day-by-day itinerary displayed via ItineraryTimeline.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that defines types for the Google Identity Services (GSI) client library, including credential responses, button configuration, and the global `window.google` interface.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates day-by-day travel itineraries based on destination, travel style (Adventure/Relaxation/Cultural/Budget), and group type (Solo/Couple/Family/Friends). Defines activity templates, group-specific tips, and day themes used to build structured itinerary objects.",
  "frontend/src/utils/structuredData.ts": "Exports functions that return JSON-LD structured data schemas for SafarX as a TravelAgency and for breadcrumb navigation, used for SEO purposes.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL parameters from both query strings and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, extending the theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color palettes (saffron, terracotta, and semantic tokens), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state of the SafarX project, recording existing features and a pending feature request to add a LinkedIn icon link to the footer alongside the existing Instagram link."
}