{
  "backend/main.mo": "Main Motoko actor for SafarX.in backend, implementing inquiry management (submit, get, delete, filter) and community user management (register, login) with admin access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting a fix to ensure the Community page's 'Connect Identity'/Google Sign-In button and CommunityAuthModal are not obscured by the fixed site header by adjusting z-index values.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key details of each component, page, hook, and config file in the SafarX.in frontend.",
  "frontend/.env.example": "Example environment variable file documenting the required VITE_GOOGLE_CLIENT_ID variable for Google OAuth 2.0 Sign-In integration.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SafarX.in app, loading Google Fonts (Playfair Display, Inter, Cormorant Garamond), the Google Identity Services script, and the React app root.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with all application routes including home, destinations, contact, admin, admin login, and community pages within a shared header/footer layout.",
  "frontend/src/components/CommunityAuthModal.tsx": "Modal dialog component for community authentication supporting username/password login, registration, and Google Identity Services sign-in with JWT decoding and form state management.",
  "frontend/src/components/CommunityFeed.tsx": "Renders a paginated feed of community travel posts with like, delete, and expand functionality. Includes a PostCard component that handles image errors, relative timestamps, and password-confirmed deletion.",
  "frontend/src/components/CommunityProfile.tsx": "Displays a logged-in user's profile page showing their posts and account details, with support for deleting posts (handling both Google and password-based auth).",
  "frontend/src/components/CreatePostModal.tsx": "A modal dialog form for creating a new community travel post with title, body, image URL, and destination fields, supporting both Google and password-authenticated users.",
  "frontend/src/components/DestinationCard.tsx": "A card component that displays a destination's image, name, region, tags, and a link to its detail page, with special badges for Gen-Z and Hill Station tags.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand info, social media links, region navigation, and quick links, rendered on a dark terracotta background.",
  "frontend/src/components/Header.tsx": "Responsive fixed navigation header for SafarX with scroll-aware background, active link highlighting, and a mobile sheet menu covering Home, Destinations, Plan My Trip, Packages, Community, and Contact routes.",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the main Header component that adds an Admin link (pointing to /admin) with a LayoutDashboard icon alongside the standard navigation links.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component that accepts a background image, headline, subheadline, and CTA props, and renders an overlay, decorative pattern, call-to-action buttons, and a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a timeline with a summary header (destination, duration, travel style) and per-day activity cards color-coded by Morning/Afternoon/Evening time slots.",
  "frontend/src/components/PackageCard.tsx": "Card component for a travel package showing its image with overlaid category/duration/price badges, a description, top three highlights, and a link to the package detail page.",
  "frontend/src/data/destinations.ts": "Static data file defining the Destination and Region TypeScript types and exporting an array of Indian travel destinations (e.g., Agra, Varanasi, Shimla) with descriptions, highlights, images, and travel info.",
  "frontend/src/data/packages.ts": "Defines the TravelPackage interface and exports an array of travel package objects (e.g., Himalayan Adventure, Rajasthan Heritage Trail) with details like destinations, price range, highlights, and category.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an anonymous or identity-authenticated actor and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity state tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching/mutating inquiries, community stats, and community users via the backend actor, plus localStorage-based admin credential registration, login, and session management hooks.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a warm earthy OKLCH color palette (saffron, terracotta, teal, ivory) for light and dark modes, and adds custom utility classes for typography, hero overlays, and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays travel inquiries and community stats/users, supports deleting inquiries, handles Internet Identity connection, and redirects to the login page if no admin session exists in localStorage.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login/registration page that checks if an admin is already registered and conditionally shows login or register forms with validation, error/success messaging, and session storage on success.",
  "frontend/src/pages/Community.tsx": "Community page with a hero banner and tabbed interface showing a community feed and user profile, with authentication modal support for login/logout.",
  "frontend/src/pages/Contact.tsx": "Contact/inquiry page with a form (name, email, phone, destination, message) that supports URL-prefilled destination params and submits inquiries via a mutation hook.",
  "frontend/src/pages/DestinationDetail.tsx": "Detail page for a single destination looked up by route param ID, displaying a hero image, metadata badges, and destination content, with a not-found fallback.",
  "frontend/src/pages/Destinations.tsx": "Destinations listing page with region tab filters and a search input that filters the destinations array, displaying results as destination cards.",
  "frontend/src/pages/Home.tsx": "The Home page component renders the landing page with a hero section, stats bar, featured destinations grid, and a 'Why Choose Us' section using data from destinations and static arrays.",
  "frontend/src/pages/Packages.tsx": "The Packages page displays a filterable grid of travel packages, allowing users to filter by category (Adventure, Cultural, Beach, etc.) using a sticky filter bar.",
  "frontend/src/pages/PlanTrip.tsx": "The PlanTrip page provides an AI-powered itinerary planner form where users select a destination, duration, travel style, and group type, then generates and displays a day-by-day itinerary.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that defines interfaces for the Google Identity Services (GSI) client library, including credential responses, button configuration, and the global `window.google` object.",
  "frontend/src/utils/itineraryGenerator.ts": "Utility module that generates structured multi-day travel itineraries based on destination, duration, travel style, and group type, using predefined activity pools and group-specific tips.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, extending the default theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (saffron, terracotta, and semantic UI colors), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 19) for the SafarX.in travel agency website, documenting existing features, known issues (admin dashboard bugs, Google Sign-In z-index problem), architectural notes, and contact details."
}