{
  "backend/main.mo": "Main Motoko actor for the SafarX.in backend, implementing user profiles, travel inquiries (submit/get/delete/list), community users, admin authentication (legacy token-based and principal-based), and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report documenting that admin-gated actor calls in the frontend now use a localStorage session token instead of Internet Identity, with updated error messages redirecting to /admin/login.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key details of each component, page, hook, and config file in the SafarX.in frontend.",
  "frontend/.env.example": "Example environment file documenting the VITE_GOOGLE_CLIENT_ID variable needed for Google OAuth 2.0 / Google Identity Services integration.",
  "frontend/index.css": "Root CSS file applying Tailwind base/components/utilities and defining OKLCH-based CSS custom properties for light and dark theme color tokens including sidebar, chart, and UI element colors.",
  "frontend/index.html": "HTML entry point for the SafarX.in app, loading Google Fonts (Playfair Display, Inter, Cormorant Garamond), the Google Identity Services script, and the Vite React entry module.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with two layout groups: a public layout (header + footer) for all user-facing routes, and a bare admin layout for /admin and /admin/login.",
  "frontend/src/components/CommunityAuthModal.tsx": "Modal dialog component handling community user login and registration via username/password forms and Google Identity Services (GSI) OAuth, with JWT payload decoding for Google sign-in.",
  "frontend/src/components/CommunityFeed.tsx": "Renders a paginated feed of community travel posts with like, delete, and expand functionality. Includes a PostCard component that handles image errors, relative timestamps, and password-confirmed deletion.",
  "frontend/src/components/CommunityProfile.tsx": "Displays a logged-in user's profile page showing their posts and account details, with support for deleting posts (handling both Google and password-based auth).",
  "frontend/src/components/CreatePostModal.tsx": "A modal dialog form for creating a new community travel post with title, body, image URL, and destination fields, supporting both Google and password-authenticated users.",
  "frontend/src/components/DestinationCard.tsx": "A card component that displays a destination's image, name, region, tags, and a link to its detail page, with special badges for Gen-Z and Hill Station tags.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand info, social media links, region navigation, and quick links, rendered on a dark terracotta background.",
  "frontend/src/components/Header.tsx": "Responsive fixed navigation header for SafarX with scroll-aware background, active link highlighting, and a mobile slide-out sheet menu covering Home, Destinations, Plan My Trip, Packages, Community, and Contact.",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the main Header component that adds an Admin link (pointing to /admin) with a LayoutDashboard icon to the navigation, otherwise identical in structure and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component that accepts a background image, headline, subheadline, and primary/secondary CTA links, with a parallax overlay and animated scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a timeline with a summary header (destination, duration, travel style) and per-activity cards color-coded by Morning/Afternoon/Evening time slots.",
  "frontend/src/components/PackageCard.tsx": "Card component for a travel package showing its image with overlaid category/duration/price badges, a description, top three highlights, and a link to the package detail page.",
  "frontend/src/data/destinations.ts": "Static data file defining the Destination TypeScript interface and an array of Indian travel destinations (e.g., Agra, Varanasi, Shimla) with region, state, descriptions, best-time, highlights, and image paths.",
  "frontend/src/data/packages.ts": "Defines the `TravelPackage` interface and exports an array of travel package objects (e.g., Himalayan Adventure, Rajasthan Heritage Trail) with details like destinations, price range, highlights, and category.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an anonymous or identity-authenticated actor and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks and helpers for admin session management, inquiry CRUD operations, community stats/user listing, and admin registration/login against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a warm earthy OKLCH color palette (saffron, terracotta, teal, ivory) for light and dark modes, and adds custom utility classes for typography, hero overlays, and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays travel inquiries, community stats, and user lists fetched via React Query hooks, with support for deleting inquiries, session expiry handling, and logout navigation.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, using Internet Identity for registration and username/password credentials for login, with session token-based redirect to the admin dashboard.",
  "frontend/src/pages/Community.tsx": "Community page with a hero banner and tabbed layout showing a community feed and user profile, with an auth modal for unauthenticated users.",
  "frontend/src/pages/Contact.tsx": "Contact/inquiry form page that supports prefilled destination from URL search params and submits travel inquiries via a mutation hook, showing a success state on completion.",
  "frontend/src/pages/DestinationDetail.tsx": "Detail page for a single destination looked up by ID from static data, displaying a hero image, badges, description, and highlights with a fallback for unknown destinations.",
  "frontend/src/pages/Destinations.tsx": "Destinations listing page with region tab filters and a text search input that filters the static destinations list, displaying results as destination cards.",
  "frontend/src/pages/Home.tsx": "The Home page component renders the landing page with a hero section, stats bar, featured destinations grid, and a 'Why Choose Us' section using data from destinations and static arrays.",
  "frontend/src/pages/Packages.tsx": "The Packages page displays a filterable grid of travel packages, allowing users to filter by category (Adventure, Cultural, Beach, etc.) using a sticky filter bar.",
  "frontend/src/pages/PlanTrip.tsx": "The PlanTrip page provides an AI-powered itinerary planner form where users select a destination, duration, travel style, and group type to generate a custom itinerary displayed via a timeline component.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that defines interfaces for the Google Identity Services (GSI) client library, including credential responses, button configuration, and the global `window.google` object.",
  "frontend/src/utils/itineraryGenerator.ts": "Utility module that generates day-by-day travel itineraries based on destination, duration, travel style, and group type, using predefined activity pools and group-specific tips.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, extending the theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), oklch-based color tokens (saffron, terracotta, and UI semantic colors), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file (version 27) for the SafarX.in travel agency website, documenting existing features, known issues (admin dashboard bugs, Google Sign-In z-index problem, admin principal mismatch), architectural notes, and contact details."
}