{
  "backend/main.mo": "Main ICP actor for the SafarX backend, implementing user profiles, travel inquiries (submit/get/delete/list), admin authentication (legacy principal-based and access-control mixin), and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — a PDF download button for itineraries and a Gemini-powered 'Explore More' section — to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and key changes, serving as a build/documentation reference for the SafarX React frontend.",
  "frontend/.env.example": "Example environment variable file listing required keys: VITE_GOOGLE_CLIENT_ID for Google Sign-In and VITE_GEMINI_API_KEY for the AI-powered Explore More feature.",
  "frontend/index.css": "Root CSS file that imports Tailwind layers and defines OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the SafarX React app, including Google Analytics 4 (G-73VJ1TQ3D7), SEO meta tags, Open Graph and Twitter Card fallbacks, Google Fonts, and the Google Sign-In script.",
  "frontend/public/robots.txt": "Standard robots.txt allowing all crawlers and pointing to the sitemap at https://safarx.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all core pages and individual destination URLs for SafarX.in with last-modified dates, change frequencies, and priority values for SEO crawling.",
  "frontend/src/App.tsx": "Defines the React application's routing tree using TanStack Router, with a public layout (header/footer) for user-facing pages and a bare layout for admin routes.",
  "frontend/src/components/CommunityAuthModal.tsx": "Modal dialog handling community user login and registration, including Google Identity Services OAuth sign-in, with form state management and JWT decoding.",
  "frontend/src/components/CommunityFeed.tsx": "Displays a paginated feed of community travel posts with like, delete (password-confirmed), and expandable body text functionality, using React Query mutations.",
  "frontend/src/components/CommunityProfile.tsx": "Shows the logged-in community user's profile info and their posts, with per-post delete functionality that supports both password and Google-authenticated users.",
  "frontend/src/components/CreatePostModal.tsx": "Modal form for creating a new community travel post with title, body, optional image URL, and destination fields, submitting via a React Query mutation.",
  "frontend/src/components/DestinationCard.tsx": "Renders a linked card for a travel destination with image, tag badges (Hidden Gem, Gen-Z, Hill Station), state label, and basic destination metadata.",
  "frontend/src/components/ExploreMoreSection.tsx": "Displays AI-powered travel suggestions for a given destination using React Query to fetch data from the Gemini API, with loading, error, and refresh states.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with brand info, social media links, region exploration links, quick navigation links, and contact details.",
  "frontend/src/components/Header.tsx": "Fixed responsive navigation header with scroll-aware styling, desktop nav links, and a mobile sheet drawer for the SafarX.in site.",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the main Header component that includes an additional Admin nav link pointing to the /admin route.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component with a background image, headline, subheadline, primary/secondary CTA buttons, and a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Renders a day-by-day itinerary timeline with morning/afternoon/evening activity cards, a summary header, and a PDF download button.",
  "frontend/src/components/PackageCard.tsx": "Renders a travel package card with image, category badge, duration, price, highlights, and a link to the package detail page.",
  "frontend/src/data/destinations.ts": "Defines the Destination and Region types and exports a static array of Indian travel destinations with metadata like descriptions, highlights, images, and travel info.",
  "frontend/src/data/packages.ts": "Defines the TravelPackage interface and exports a static array of curated travel packages with destinations, pricing, highlights, and category info.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend interactions including inquiry CRUD, community stats, and admin authentication with session token management via localStorage.",
  "frontend/src/hooks/useSEO.ts": "A React hook that dynamically sets document title, meta description, Open Graph, and Twitter Card tags, restoring previous values on cleanup.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS, defines SafarX's warm earthy OKLCH color palette as CSS variables for light and dark modes, and adds custom utility classes for typography, layout, and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/Admin.tsx": "Protected admin dashboard page that displays and manages travel inquiries (with search/sort/delete) and community stats/users across two tabs, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, requiring Internet Identity for registration and storing a session token on success before redirecting to the dashboard.",
  "frontend/src/pages/Community.tsx": "Community page with a hero banner and tabbed interface showing a social feed and user profile, with an auth modal for unauthenticated users to log in.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form (name, email, phone, destination, message) that submits inquiries via the useSubmitInquiry hook, alongside contact info sidebar showing address, phone, email, and hours. Includes SEO metadata via useSEO.",
  "frontend/src/pages/DestinationDetail.tsx": "Detail page for a single destination looked up by ID from static data, rendering a hero image, badges, description, highlights, and best-time-to-visit info with SEO tags. Shows a not-found state if the destination ID is invalid.",
  "frontend/src/pages/Destinations.tsx": "Destinations listing page with region tab filters and a search input that filters the static destinations array, separating hidden gems into a distinct section. Injects BreadcrumbList JSON-LD and sets SEO metadata.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a hero section, 8 featured destination cards, stats bar, and a 'Why Choose Us' grid, with TravelAgency JSON-LD structured data injected on mount. Sets full SEO/OG/Twitter metadata via useSEO.",
  "frontend/src/pages/Packages.tsx": "Travel packages listing page with a category filter bar that filters the static travelPackages array and renders PackageCard components. Injects BreadcrumbList JSON-LD and sets SEO/OG metadata.",
  "frontend/src/pages/PlanTrip.tsx": "React page that renders a trip planning form (destination, duration, travel style, group type) and displays a generated day-by-day itinerary using react-hook-form and custom hooks. Includes SEO metadata and integrates ItineraryTimeline and ExploreMoreSection components.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that adds type definitions for the Google Identity Services (GSI) client library, including interfaces for credential responses, button configuration, and the global window.google object.",
  "frontend/src/utils/geminiClient.ts": "Utility that calls the Gemini 2.0 Flash API to fetch personalized 'Explore More' travel suggestions (4 categorized tips plus a local insider tip) for a given destination, duration, travel style, and group type.",
  "frontend/src/utils/itineraryGenerator.ts": "Core itinerary generation utility that holds large per-destination, per-travel-style activity pools and assembles a structured day-by-day GeneratedItinerary object based on destination ID, duration, travel style, and group type.",
  "frontend/src/utils/pdfGenerator.ts": "Utility that opens a new browser window with a fully styled HTML representation of a GeneratedItinerary and triggers the browser's print-to-PDF dialog to let users download their itinerary as a PDF.",
  "frontend/src/utils/structuredData.ts": "Exports helper functions that return Schema.org JSON-LD objects for a TravelAgency (SafarX) and a BreadcrumbList, used for SEO structured data injection.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (including saffron and terracotta palettes), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the SafarX project state at version 3, recording two existing features (PDF download button and Gemini-powered 'Explore More' section) and two corresponding pending action requests."
}