{
  "backend/main.mo": "Main Motoko actor for the SafarX backend, implementing user profiles, travel inquiries (submit/get/delete/list), admin authentication (legacy principal-based and access-control mixin), and community user management with role-based access control.",
  "feature_evidence.json": "Feature evidence report confirming that the Google Analytics gtag.js snippet (tracking ID G-73VJ1TQ3D7) has been injected into frontend/index.html immediately after the opening head tag.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose, key features, and notable implementation details for build planning reference.",
  "frontend/.env.example": "Example environment variable file documenting the required VITE_GOOGLE_CLIENT_ID variable for Google OAuth 2.0 / Google Identity Services integration.",
  "frontend/index.css": "Root CSS file that imports Tailwind base/components/utilities and defines OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the SafarX frontend with Google Analytics (G-73VJ1TQ3D7) as the first head element, followed by SEO meta tags, Open Graph, Twitter Card, canonical link, Google Fonts, and Google Identity Services script.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with two layout groups: a public layout (header + footer) for standard routes and a bare admin layout (no header/footer) for /admin and /admin/login routes.",
  "frontend/src/components/CommunityAuthModal.tsx": "Modal dialog component supporting username/password login, registration, and Google Identity Services sign-in for community authentication, decoding JWT payloads and calling backend mutation hooks on success.",
  "frontend/src/components/CommunityFeed.tsx": "Renders a paginated feed of community travel posts with like, delete, and expand functionality. Includes a PostCard component that handles image errors, relative timestamps, and password-confirmed deletion.",
  "frontend/src/components/CommunityProfile.tsx": "Displays a logged-in user's profile page showing their posts and account details, with support for deleting posts (handling both Google and password-based auth users).",
  "frontend/src/components/CreatePostModal.tsx": "A modal dialog form for creating a new community travel post with title, body, image URL, and destination fields, supporting both Google and password-authenticated sessions.",
  "frontend/src/components/DestinationCard.tsx": "A card component that links to a destination detail page, displaying the destination's image, tags, region badge, and a short description.",
  "frontend/src/components/Footer.tsx": "Site-wide footer component with brand info, social media links, region navigation links, and quick links rendered in a responsive grid layout.",
  "frontend/src/components/Header.tsx": "Responsive fixed navigation header for SafarX with scroll-aware background, active link highlighting, and a mobile sheet drawer. Includes links to Home, Destinations, Plan My Trip, Packages, Community, and Contact.",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the main Header component that adds an Admin link (pointing to /admin) alongside the standard navigation links, otherwise identical in structure and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component that accepts a background image, headline, subheadline, and CTA props, and renders an overlay, decorative pattern, call-to-action buttons, and a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a styled timeline with a summary header and per-day activity cards grouped by Morning, Afternoon, and Evening time slots using color-coded icons.",
  "frontend/src/components/PackageCard.tsx": "Card component for displaying a travel package with image, category/duration badges, price, destination list, short description, and top highlights, linking to the package detail page.",
  "frontend/src/data/destinations.ts": "Static data file defining the Destination and Region TypeScript types and exporting an array of Indian travel destinations with details like description, best time to visit, highlights, and image paths.",
  "frontend/src/data/packages.ts": "Defines the TravelPackage interface and exports an array of curated Indian travel packages (e.g., Himalayan Adventure, Rajasthan Heritage, Kerala Backwaters) with details like duration, destinations, price range, highlights, and images.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks and helpers for admin session management, travel inquiry CRUD operations, community stats/user listing, and admin registration/authentication against the ICP backend.",
  "frontend/src/hooks/useSEO.ts": "Custom hook that dynamically updates the document title and meta description on mount and restores the previous values on unmount.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a warm earthy OKLCH color palette (saffron, terracotta, teal, ivory) for light and dark modes, and adds custom utility classes for typography, hero overlays, and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays travel inquiries, community stats, and user lists fetched from the ICP backend, with support for deleting inquiries, session expiry handling, and logout functionality.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, using Internet Identity for registration and username/password for login, with session token management and redirect to admin dashboard on success.",
  "frontend/src/pages/Community.tsx": "Community page with a hero banner and tabbed interface showing a travel feed and user profile, with authentication modal support for community login/logout.",
  "frontend/src/pages/Contact.tsx": "Contact/inquiry page with a form (name, email, phone, destination, message) that supports URL-prefilled destination params and submits inquiries via a mutation hook.",
  "frontend/src/pages/DestinationDetail.tsx": "Detail page for a single destination, rendering a hero image, badges, and full description based on a route param ID matched against the static destinations data.",
  "frontend/src/pages/Destinations.tsx": "Destinations listing page with region tab filters and a search input, rendering filtered DestinationCard components and injecting BreadcrumbList JSON-LD structured data.",
  "frontend/src/pages/Home.tsx": "The Home page component renders the main landing page with a hero section, stats bar, featured destinations, and a 'Why Choose Us' section, while injecting SEO metadata and TravelAgency JSON-LD structured data.",
  "frontend/src/pages/Packages.tsx": "The Packages page displays filterable travel package cards by category, with a hero banner, sticky filter bar, and BreadcrumbList JSON-LD structured data injected for SEO.",
  "frontend/src/pages/PlanTrip.tsx": "The PlanTrip page provides an AI-powered trip planner form where users select a destination, duration, travel style, and group type to generate a custom day-by-day itinerary displayed via ItineraryTimeline.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that defines interfaces for the Google Identity Services (GSI) client library, including credential responses, button configuration, and the global `window.google` object.",
  "frontend/src/utils/itineraryGenerator.ts": "Utility module that generates a structured day-by-day travel itinerary based on destination, duration, travel style, and group type, using predefined activity pools and group-specific tips.",
  "frontend/src/utils/structuredData.ts": "Provides helper functions to generate Schema.org JSON-LD objects for a TravelAgency and BreadcrumbList, used for SEO structured data injection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, extending the theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), oklch-based color tokens (including saffron and terracotta palettes), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the SafarX project's state at version 3, recording that Google Analytics (G-73VJ1TQ3D7) has been integrated into frontend/index.html immediately after the opening head tag as the sole existing feature."
}