{
  "backend/main.mo": "Main Motoko actor for SafarX.in backend, implementing inquiry management (submit, get, delete, filter) and community user management (register, login, profile) with admin access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing planned frontend features: fixing admin dashboard inquiry fetch, adding community stats React Query hooks, updating Admin page with community stats section, and related test/component references.",
  "frontend-file-summaries.txt": "JSON map of short summaries for each frontend source file, describing the purpose and key contents of every component, page, hook, and config file in the project.",
  "frontend/.env.example": "Example environment file documenting the required VITE_GOOGLE_CLIENT_ID variable for Google OAuth 2.0 Sign-In integration.",
  "frontend/index.css": "Root CSS file applying Tailwind base/components/utilities and defining OKLCH-based CSS custom properties for light and dark theme color tokens including sidebar and chart colors.",
  "frontend/index.html": "HTML entry point for the SafarX.in app, loading Google Fonts (Playfair Display, Inter, Cormorant Garamond), the Google Identity Services script, and the Vite React entry module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all application routes including home, destinations, contact, admin, admin login, and community pages within a shared header/footer layout.",
  "frontend/src/components/CommunityAuthModal.tsx": "Modal dialog component handling community user login and registration with username/password forms and Google Identity Services OAuth sign-in, managing form state and calling backend mutation hooks.",
  "frontend/src/components/CommunityFeed.tsx": "Renders a paginated feed of community travel posts with like, delete, and expand functionality. Includes a PostCard component with image display, relative timestamps, and a password-protected delete flow.",
  "frontend/src/components/CommunityProfile.tsx": "Displays a logged-in user's profile page showing their info and a list of their posts, each with a delete option that supports both password and Google auth flows.",
  "frontend/src/components/CreatePostModal.tsx": "A modal dialog form for creating a new community travel post with title, body, image URL, and destination fields, supporting both password and Google-authenticated users.",
  "frontend/src/components/DestinationCard.tsx": "A card component that links to a destination detail page, displaying the destination's image, tags, region badge, name, and short description.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand info, social media links, region navigation links, and quick links, rendered on a dark terracotta background.",
  "frontend/src/components/Header.tsx": "Responsive fixed navigation header for SafarX.in with scroll-aware background, active link highlighting, and a mobile slide-out sheet menu covering Home, Destinations, Plan My Trip, Packages, Community, and Contact routes.",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the main Header component that adds an Admin link (pointing to /admin) alongside the standard navigation links, otherwise identical in layout and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component that accepts a background image, headline, subheadline, and primary/secondary CTA props, and includes a scroll-down chevron button.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a timeline with a summary header (destination, duration, travel style) and per-activity cards color-coded by Morning/Afternoon/Evening time slots.",
  "frontend/src/components/PackageCard.tsx": "Card component for a travel package showing its image with overlaid category/duration/price badges, a short description, top three highlights, and a link to the package detail page.",
  "frontend/src/data/destinations.ts": "Static data file defining the Destination TypeScript interface and an array of Indian travel destinations (e.g., Agra, Varanasi, Shimla) with descriptions, best visit times, highlights, images, and region/state metadata.",
  "frontend/src/data/packages.ts": "Defines the TravelPackage interface and exports an array of travel package objects for destinations across India, including details like duration, price range, highlights, and category.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity state tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating inquiries, community stats/users, and admin authentication (localStorage-based login/register), plus community session management.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a warm earthy OKLCH color palette for light and dark modes, and adds custom utility classes for typography, layout, and UI effects.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page that displays travel inquiries and community stats/users, supports deleting inquiries, and handles admin session management with optional Internet Identity connection.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login/registration page that checks if an admin is already registered and conditionally shows login or register forms with validation, error/success messaging, and session storage on success.",
  "frontend/src/pages/Community.tsx": "Community page with a hero banner and tabbed interface showing a community feed and user profile, with authentication modal support for login/logout via session state.",
  "frontend/src/pages/Contact.tsx": "Contact/inquiry page with a form (name, email, phone, destination, message) that supports URL-prefilled destination params, submits via a mutation hook, and shows a success state on completion.",
  "frontend/src/pages/DestinationDetail.tsx": "Detail page for a single destination looked up by route param ID, displaying a hero image, metadata badges, and destination content, with a not-found fallback.",
  "frontend/src/pages/Destinations.tsx": "Destinations listing page with region tab filters and a search input that filters the destinations array, displaying results as destination cards under a hero header.",
  "frontend/src/pages/Home.tsx": "The Home page component renders the landing page with a hero section, stats bar, featured destinations grid, and a 'Why Choose Us' section using data from destinations and static arrays.",
  "frontend/src/pages/Packages.tsx": "The Packages page displays filterable travel packages by category, with a hero banner, sticky filter bar, and a grid of PackageCard components sourced from the packages data file.",
  "frontend/src/pages/PlanTrip.tsx": "The PlanTrip page provides an AI-powered itinerary planner form where users select a destination, duration, travel style, and group type, then generates and displays a day-by-day itinerary timeline.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that defines interfaces for the Google Identity Services (GSI) client library, including credential responses, button configuration, and the global window.google object.",
  "frontend/src/utils/itineraryGenerator.ts": "Utility module that generates structured multi-day travel itineraries based on destination, duration, travel style, and group type, using predefined activity pools, day themes, and group-specific tips.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, extending the theme with custom fonts (Playfair Display, Cormorant Garamond, Inter), OKLCH-based color tokens (saffron, terracotta, and UI semantic colors), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 17) for the SafarX.in travel agency website, documenting existing features, known issues (admin dashboard enquiries and community stats), architectural notes, and fix request status."
}