{
  "backend/main.mo": "Main Motoko actor for the SafarX backend, implementing user profiles, travel inquiries (submit/get/delete/list), admin authentication (legacy principal-based and access-control mixin), and community/authorization features using imported mixins.",
  "feature_evidence.json": "Feature evidence report confirming implementation of two SEO features: a static XML sitemap at frontend/public/sitemap.xml and a sitemap link tag in frontend/index.html plus a robots.txt file.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of all frontend source files, describing each component, page, hook, and config file in the SafarX React application.",
  "frontend/.env.example": "Example environment variable file documenting the required VITE_GOOGLE_CLIENT_ID variable for Google OAuth 2.0 Sign-In integration.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SafarX app including primary SEO meta tags, Open Graph and Twitter Card fallback tags, a sitemap link reference, Google Fonts, Google Sign-In script, and Google Analytics.",
  "frontend/public/robots.txt": "Robots.txt file that allows all crawlers to access all pages and points them to the sitemap at https://safarx.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public SafarX pages including core routes and 20+ individual destination detail pages, each with loc, lastmod, changefreq, and priority values.",
  "frontend/src/App.tsx": "Defines the React application's route tree using TanStack Router, splitting routes into a public layout (with header/footer) and an admin layout (bare), and exports the RouterProvider-wrapped App component.",
  "frontend/src/components/CommunityAuthModal.tsx": "A modal dialog component handling community user login and registration, including Google Identity Services OAuth sign-in, with form state management and JWT payload decoding.",
  "frontend/src/components/CommunityFeed.tsx": "Renders a paginated feed of community travel posts with like, delete (password-confirmed), and expand/collapse functionality, using React Query hooks for data fetching and mutations.",
  "frontend/src/components/CommunityProfile.tsx": "Displays a logged-in community user's profile information and their posts, with per-post delete functionality that supports both password-based and Google-authenticated users.",
  "frontend/src/components/CreatePostModal.tsx": "A modal form for creating a new community travel post with title, body, optional image URL, and destination fields, submitting via a React Query mutation and handling Google vs. password auth.",
  "frontend/src/components/DestinationCard.tsx": "A card component that displays a destination's image, tags, region badge, and short description, linking to the destination detail page via TanStack Router.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with brand info, social links, region navigation, quick links, and contact details for SafarX.in.",
  "frontend/src/components/Header.tsx": "Fixed responsive navigation header with scroll-aware styling, desktop nav links, and a mobile sheet drawer for SafarX.in (without admin link).",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the Header component that includes an additional Admin nav link pointing to /admin, otherwise identical in structure and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component with a parallax background image, headline, subheadline, primary/secondary CTA buttons, and a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated trip itinerary as a timeline with day-by-day activity cards grouped by morning/afternoon/evening, plus a summary header with trip metadata.",
  "frontend/src/components/PackageCard.tsx": "Card component for displaying a travel package with image, category/duration badges, price, destination list, description, and top highlights.",
  "frontend/src/data/destinations.ts": "Defines the `Destination` and `Region` TypeScript types and exports a large static array of Indian travel destinations with details like description, highlights, best time to visit, and images.",
  "frontend/src/data/packages.ts": "Defines the `TravelPackage` TypeScript interface and exports a static array of curated Indian travel packages with duration, destinations, price ranges, and highlights.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend interactions including inquiry CRUD, community stats, and admin authentication (register, login, session management) using a localStorage-based session token.",
  "frontend/src/hooks/useSEO.ts": "Custom React hook that dynamically updates the document title, meta description, Open Graph, and Twitter Card tags on mount and restores previous values on cleanup.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind layers and defines a warm earthy CSS custom property palette (saffron, terracotta, teal, ivory) for both light and dark modes, plus utility classes for typography, card hover effects, hero overlays, and gradient helpers.",
  "frontend/src/main.tsx": "React application entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/Admin.tsx": "Protected admin dashboard page that displays and manages travel inquiries (with search, sort, and delete) and community stats/users across two tabs, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, integrating Internet Identity for registration and storing a session token on success before redirecting to the dashboard.",
  "frontend/src/pages/Community.tsx": "Community hub page with a hero banner and tabbed interface for a social feed and user profile, gating authenticated actions behind a CommunityAuthModal.",
  "frontend/src/pages/Contact.tsx": "Contact page with a travel inquiry form that submits user details (name, email, phone, destination, message) to the backend via a mutation hook and shows a success state on completion.",
  "frontend/src/pages/DestinationDetail.tsx": "Renders a detailed page for a single destination, showing a hero image, badges, highlights, and SEO metadata. Displays a 404-style fallback if the destination ID is not found.",
  "frontend/src/pages/Destinations.tsx": "Displays a filterable, searchable grid of all destinations grouped by region using tabs. Injects SEO metadata and a BreadcrumbList JSON-LD structured data script.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with a hero section, stats bar, featured destinations, and a 'why choose us' section. Injects SEO metadata and a TravelAgency JSON-LD structured data script.",
  "frontend/src/pages/Packages.tsx": "Displays a category-filterable list of curated travel packages with a hero banner. Injects SEO metadata and a BreadcrumbList JSON-LD structured data script.",
  "frontend/src/pages/PlanTrip.tsx": "Provides an AI-powered trip planner form where users select destination, duration, travel style, and group type to generate a day-by-day itinerary with a simulated delay.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file for the Google Identity Services (GSI) client library, defining interfaces for credential responses, button configuration, prompt notifications, and the global `window.google` object.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates day-by-day travel itineraries based on destination, travel style (Adventure/Relaxation/Cultural/Budget), and group type (Solo/Couple/Family/Friends), with predefined activity templates, day themes, and group-specific tips.",
  "frontend/src/utils/structuredData.ts": "Exports functions that return JSON-LD structured data schemas for SafarX as a TravelAgency and for breadcrumb navigation lists.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, defining custom fonts, an extended color palette (including saffron and terracotta scales using OKLCH), dark mode, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the SafarX project's current state including existing features (static XML sitemap generation and robots.txt setup) and a pending new feature request to improve search engine discoverability."
}