{
  "backend/main.mo": "Main Motoko actor for the SafarX backend, implementing user profiles, travel inquiries (submit/get/delete/list), admin authentication (legacy and access-control-based), and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report confirming the Google Analytics 4 gtag.js snippet (ID: G-73VJ1TQ3D7) was inserted into frontend/index.html immediately after the opening <head> tag.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their purpose, key features, and notable recent changes.",
  "frontend/.env.example": "Example environment file documenting the VITE_GOOGLE_CLIENT_ID variable needed for Google OAuth 2.0 Sign-In integration.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the SafarX frontend with the GA4 gtag.js snippet as the first element in <head>, followed by SEO meta tags, Open Graph/Twitter Card fallbacks, Google Fonts, and Google Sign-In script.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to the sitemap at https://safarx.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all core pages and individual destination pages for safarx.in with last-modified dates, change frequencies, and priority values.",
  "frontend/src/App.tsx": "Main React app component that configures TanStack Router with two layout groups: a public layout (header + footer) for standard routes and a bare admin layout for /admin and /admin/login routes.",
  "frontend/src/components/CommunityAuthModal.tsx": "A modal dialog component handling user login and registration for the community, including Google Identity Services OAuth integration and JWT decoding.",
  "frontend/src/components/CommunityFeed.tsx": "Displays a paginated feed of community travel posts with like, delete, and expand functionality, rendering each post as a card with image, metadata, and author info.",
  "frontend/src/components/CommunityProfile.tsx": "Shows the logged-in user's profile page including their posts list with per-post delete functionality, supporting both password-based and Google-authenticated users.",
  "frontend/src/components/CreatePostModal.tsx": "A modal form for creating a new community travel post with fields for title, body, image URL, and destination, supporting both regular and Google-authenticated sessions.",
  "frontend/src/components/DestinationCard.tsx": "A card component that displays a travel destination with its image, tags, region badge, and a link to the destination detail page.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with brand info, social media links, region exploration links, quick navigation links, and contact details for SafarX.in.",
  "frontend/src/components/Header.tsx": "Fixed responsive navigation header with scroll-aware styling, desktop nav links, and a mobile sheet drawer for SafarX.in (without admin link).",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the Header component that includes an additional Admin nav link pointing to /admin, otherwise identical in structure and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component with a parallax background image, headline, subheadline, primary/secondary CTA buttons, and a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a timeline with day-by-day activity cards grouped by morning/afternoon/evening, plus a summary header with trip metadata.",
  "frontend/src/components/PackageCard.tsx": "Card component for displaying a travel package with image, category/duration badges, price, destination list, description, and top highlights.",
  "frontend/src/data/destinations.ts": "Defines the `Destination` and `Region` TypeScript types and exports a large static array of Indian travel destinations with details like description, highlights, best time to visit, and images.",
  "frontend/src/data/packages.ts": "Defines the `TravelPackage` TypeScript interface and exports a static array of curated Indian travel packages with duration, destinations, price ranges, and highlights.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend interactions including inquiry CRUD, community stats, and admin authentication (register, login, session management) using a localStorage-based session token.",
  "frontend/src/hooks/useSEO.ts": "Custom React hook that dynamically updates the document title and meta tags (description, Open Graph, Twitter Card) for a given page, restoring previous values on cleanup.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind layers and defines a warm earthy CSS custom property palette (saffron, terracotta, ivory, teal) for both light and dark modes, plus utility classes for typography, card hover effects, hero overlays, and gradient helpers.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Admin.tsx": "Protected admin dashboard page that displays and manages travel inquiries (with search, sort, and delete) and community stats/users across two tabs, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, integrating Internet Identity for registration and storing a session token on success before redirecting to the dashboard.",
  "frontend/src/pages/Community.tsx": "Community hub page with a hero banner and tabbed interface showing a travel story feed and user profile, with an auth modal for unauthenticated users to log in.",
  "frontend/src/pages/Contact.tsx": "Contact page with a travel inquiry form (name, email, phone, destination, message) that submits to the backend via a mutation hook and shows a success state on completion.",
  "frontend/src/pages/DestinationDetail.tsx": "Renders a detailed page for a single destination, showing a hero image, badges, description, highlights, and travel tips, with SEO metadata and a 404 fallback if the destination is not found.",
  "frontend/src/pages/Destinations.tsx": "Displays a filterable, searchable grid of all destinations grouped by region, with SEO metadata and BreadcrumbList JSON-LD structured data injected on mount.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with a hero section, stats bar, featured destinations, and a 'why choose us' section, along with SEO metadata and TravelAgency JSON-LD structured data.",
  "frontend/src/pages/Packages.tsx": "Displays a category-filterable list of curated travel packages with a hero banner, SEO metadata, and BreadcrumbList JSON-LD structured data.",
  "frontend/src/pages/PlanTrip.tsx": "Provides an AI-powered trip planner form where users select a destination, duration, travel style, and group type to generate a day-by-day itinerary displayed via ItineraryTimeline.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file that defines types for the Google Identity Services (GSI) client library, including credential responses, button configuration, and the global window.google interface.",
  "frontend/src/utils/itineraryGenerator.ts": "Defines types and data for generating travel itineraries, including activity sets per travel style (Adventure, Relaxation, Cultural, Budget), group-specific tips, and day themes used to build structured multi-day trip plans.",
  "frontend/src/utils/structuredData.ts": "Exports functions that return JSON-LD structured data schemas for SafarX as a TravelAgency and for breadcrumb navigation lists.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SafarX frontend, extending the theme with custom fonts, OKLCH-based color palettes (saffron, terracotta, and semantic tokens), and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state for SafarX at version 3, recording that Google Analytics 4 (GA4) with Measurement ID G-73VJ1TQ3D7 has been integrated into the frontend index.html."
}