{
  "backend/main.mo": "Main ICP actor for the SafarX backend, implementing user profile management, travel inquiry submission/retrieval/deletion, and admin authentication using both legacy principal-based credentials and a role-based access control mixin.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: fixing duplicate places in the AI itinerary generator, and expanding the Indian destinations dataset with hidden gem locations including curated activity sets.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing their purpose, key changes, and notable implementation details across the SafarX React app.",
  "frontend/.env.example": "Example environment variable file documenting the required VITE_GOOGLE_CLIENT_ID variable for Google OAuth 2.0 Sign-In integration, with setup instructions.",
  "frontend/index.css": "Root CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the SafarX frontend, including Google Analytics 4 tracking, SEO meta tags, Open Graph and Twitter Card fallbacks, Google Fonts preloads, and the Google Sign-In script.",
  "frontend/public/robots.txt": "Standard robots.txt allowing all crawlers and pointing to the sitemap at https://safarx.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all core pages and individual destination detail pages for SafarX with last-modified dates, change frequencies, and priority values for SEO crawling.",
  "frontend/src/App.tsx": "Defines the React application's routing tree using TanStack Router, with a public layout (header/footer) for user-facing pages and a bare layout for admin routes.",
  "frontend/src/components/CommunityAuthModal.tsx": "A modal dialog component handling community user login and registration, including Google Identity Services OAuth sign-in and JWT payload decoding.",
  "frontend/src/components/CommunityFeed.tsx": "Displays a paginated feed of community travel posts with like, delete, and expand functionality, using query hooks to fetch and mutate post data.",
  "frontend/src/components/CommunityProfile.tsx": "Shows a logged-in community user's profile and their posts, with the ability to delete posts (supporting both password and Google-authenticated users).",
  "frontend/src/components/CreatePostModal.tsx": "A modal form for creating and submitting a new community travel post, with fields for title, body, image URL, and destination, supporting both password and Google-authenticated sessions.",
  "frontend/src/components/DestinationCard.tsx": "A card component that renders a destination's image, tags, name, and metadata as a navigable link to the destination detail page.",
  "frontend/src/components/Footer.tsx": "Renders the site-wide footer with brand info, social media links, region exploration links, quick navigation links, and contact details for SafarX.in.",
  "frontend/src/components/Header.tsx": "Fixed responsive navigation header with scroll-aware styling, logo, desktop nav links, and a mobile sheet drawer for SafarX.in (without admin link).",
  "frontend/src/components/HeaderWithAdmin.tsx": "Variant of the Header component that includes an additional Admin nav link pointing to /admin, otherwise identical in structure and behavior.",
  "frontend/src/components/HeroSection.tsx": "Reusable full-screen hero section component with a parallax background image, headline, subheadline, primary/secondary CTA buttons, and a scroll-down indicator.",
  "frontend/src/components/ItineraryTimeline.tsx": "Displays a generated travel itinerary as a timeline with day-by-day activity cards grouped by Morning/Afternoon/Evening, plus a summary header showing destination, duration, and travel style.",
  "frontend/src/components/PackageCard.tsx": "Card component for displaying a travel package with image, category/duration badges, price, destinations, description, and top highlights with a link to the package detail page.",
  "frontend/src/data/destinations.ts": "Defines the `Destination` and `Region` TypeScript types and exports a large static array of Indian travel destinations with details like description, highlights, best time to visit, and image paths.",
  "frontend/src/data/packages.ts": "Defines the `TravelPackage` TypeScript interface and exports a static array of curated Indian travel packages with duration, destinations, price ranges, highlights, and images.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend interactions including inquiry submission/deletion, community stats, admin registration/login, and admin session token management via localStorage.",
  "frontend/src/hooks/useSEO.ts": "Custom React hook that dynamically sets and cleans up document title, meta description, Open Graph, and Twitter Card tags for SEO on a per-page basis.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind layers and defines a warm earthy CSS custom property palette (saffron, terracotta, ivory, teal) for both light and dark modes, plus utility classes for typography, card hover effects, hero overlays, and gradient helpers.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and a custom InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/Admin.tsx": "Protected admin dashboard page that displays and manages travel inquiries (with search, sort, and delete) and community stats/users across two tabs, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/AdminLogin.tsx": "Admin authentication page supporting both login and registration modes, integrating Internet Identity for registration and storing a session token on success before redirecting to the dashboard.",
  "frontend/src/pages/Community.tsx": "Community hub page featuring a hero banner and tabbed interface for a social feed and user profile, with an auth modal for unauthenticated users to join the traveler community.",
  "frontend/src/pages/Contact.tsx": "Contact page with a travel inquiry form (name, email, phone, destination, message) that submits to the backend via a mutation hook and shows a success state on completion.",
  "frontend/src/pages/DestinationDetail.tsx": "Renders a detailed page for a single destination, showing a hero image, badges, description, highlights, and travel tips, with SEO metadata and a 404 fallback if the destination is not found.",
  "frontend/src/pages/Destinations.tsx": "Displays a filterable, searchable grid of all destinations grouped by region, with a hidden gems section, SEO metadata, and breadcrumb JSON-LD structured data.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with a hero section, featured destinations grid, stats, and 'why choose us' section, along with SEO metadata and TravelAgency JSON-LD structured data.",
  "frontend/src/pages/Packages.tsx": "Displays a category-filterable list of curated travel packages with a hero banner, SEO metadata, and breadcrumb JSON-LD structured data.",
  "frontend/src/pages/PlanTrip.tsx": "Provides an AI-powered trip planner form where users select a destination, duration, travel style, and group type to generate a custom day-by-day itinerary displayed via ItineraryTimeline.",
  "frontend/src/types/google-gsi.d.ts": "TypeScript declaration file for the Google Identity Services (GSI) client library, defining interfaces for credential responses, button configuration, prompt notifications, and the global window.google object.",
  "frontend/src/utils/itineraryGenerator.ts": "Generates day-by-day travel itineraries for Indian destinations based on travel style, group type, and duration, using curated per-destination activity pools. Exports types and a generator function that assembles activities, tips, and travel info into a structured itinerary object.",
  "frontend/src/utils/structuredData.ts": "Provides helper functions to generate Schema.org JSON-LD structured data objects for the SafarX travel agency and breadcrumb navigation lists.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, with sessionStorage persistence helpers for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts, OKLCH-based color palettes (saffron, terracotta, and semantic tokens), and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state including architectural notes, known bugs, existing features, and pending feature requests (AR items) such as fixing duplicate itinerary places, adding hidden gem destinations, PDF download, and Gemini API integration."
}