{
  "kind": "build_request",
  "title": "Fix Connect Identity / Google Sign-In button hidden behind header",
  "projectName": "SafarX.in",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Fix the 'Connect Identity' / Google Sign-In button on the Community page and CommunityAuthModal so it is no longer obscured by the fixed site header. Ensure the modal/panel and its trigger button have a z-index higher than the header (the header uses a fixed position with its own stacking context), and that any modal overlay, dialog container, or inline auth panel is rendered with sufficient z-index (e.g., z-50 or higher) and correct top/padding offset so the button is fully visible and clickable without being covered by the navigation bar.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "connect identity button is hiding behind the header, so fix that button"
        ]
      },
      "acceptanceCriteria": [
        "The Google Sign-In / Connect Identity button is fully visible and not overlapped by the site header on all screen sizes.",
        "The CommunityAuthModal dialog/panel renders above the fixed header (z-index higher than the header's stacking context).",
        "Clicking the Sign-In button is not blocked by the header element on desktop and mobile viewports.",
        "The modal overlay (if present) also sits above the header and covers the full viewport.",
        "No regression to header functionality or other modal/dialog components."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, frontend/src/components/ui).",
    "Do not alter the header's layout, navigation links, or scroll-aware background behavior."
  ],
  "nonGoals": [
    "Redesigning the header or changing its height.",
    "Changing the Google Sign-In authentication flow or session logic.",
    "Fixing any other known issues (admin enquiries fetch, community stats display)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}