{
  "kind": "build_request",
  "title": "Fix admin dashboard: enquiries loading failure and community stats",
  "projectName": "SafarX.in",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Debug and fix the admin dashboard enquiries fetch in `frontend/src/pages/Admin.tsx` and `frontend/src/hooks/useQueries.ts`. Inspect the backend actor call used to retrieve all inquiries (e.g. `getAllInquiries` or equivalent), ensure the correct method name is being called on the actor, that the actor hook is resolving properly before the query fires (use `enabled: !!actor` guard in React Query), and that the returned data shape is correctly mapped to the card/table display. If the backend method name or return type has drifted, align the frontend call to match the actual exported function in `backend/main.mo`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the enquiries are failed to load"
        ]
      },
      "acceptanceCriteria": [
        "Opening /admin (while logged in) successfully fetches and displays all submitted enquiries without an error state.",
        "Each inquiry card shows name, email, phone, destination/travel interest, message, and submission timestamp.",
        "The Delete button on each card calls the correct backend delete function and removes the entry from the list on success.",
        "If no inquiries exist, a friendly empty-state message is shown instead of an error."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Add backend query functions to `backend/main.mo` to expose community statistics needed by the admin dashboard: (1) `getCommunityStats() : async { totalMembers: Nat; totalPosts: Nat }` — returns the count of all registered community users and all community posts; (2) `getAllCommunityUsers() : async [{ userId: Nat; username: Text; displayName: Text; joinedAt: Int }]` — returns a list of all registered community users (no passwords). These must read from the existing stable `communityUsers` map.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Total number of registered community members",
          "A list of registered usernames and display names",
          "Total number of community posts"
        ]
      },
      "acceptanceCriteria": [
        "`getCommunityStats()` returns correct `totalMembers` and `totalPosts` counts reflecting current stable state.",
        "`getAllCommunityUsers()` returns an array of objects each containing userId, username, displayName, and joinedAt — no passwordHash field included.",
        "Both functions are publicly accessible query methods (no admin token required at the canister level, since the admin frontend route is already protected)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Add React Query hooks in `frontend/src/hooks/useQueries.ts` for the new community stats backend calls: `useCommunityStats` (calls `getCommunityStats`) and `useCommunityUserList` (calls `getAllCommunityUsers`). Both hooks must use the actor from `useActor` and include an `enabled: !!actor` guard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Total number of registered community members",
          "A list of registered usernames and display names",
          "Total number of community posts"
        ]
      },
      "acceptanceCriteria": [
        "`useCommunityStats` hook returns `{ totalMembers, totalPosts }` from the backend.",
        "`useCommunityUserList` hook returns an array of `{ userId, username, displayName, joinedAt }` objects.",
        "Both hooks are exported from `useQueries.ts` and do not fire until the actor is available."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Update the Admin Dashboard page `frontend/src/pages/Admin.tsx` to display a 'Community Stats' section below the enquiries list. This section must show: (1) Total registered community members (number), (2) Total community posts (number), and (3) A scrollable table or card list of all registered community users showing their display name and username side by side. Use the `useCommunityStats` and `useCommunityUserList` hooks. Show loading skeletons while fetching and friendly error messages on failure. Style the section consistently with the existing warm-earthy SafarX.in theme (saffron/terracotta headings, ivory card backgrounds).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "not able to get Total number of registered community members",
          "A list of registered usernames and display names",
          "Total number of community posts"
        ]
      },
      "acceptanceCriteria": [
        "Admin dashboard shows a 'Community Stats' section with total member count and total post count displayed as stat badges or summary cards.",
        "A list/table of all community users is rendered showing displayName and username for each user.",
        "Loading states show skeletons and error states show an inline error message rather than crashing the page.",
        "The community stats section is visually consistent with the warm-earthy SafarX.in theme."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All Motoko logic must remain in the single actor file backend/main.mo.",
    "Do not expose passwordHash in any backend community user query response."
  ],
  "nonGoals": [
    "Adding new admin authentication mechanisms.",
    "Changing the existing community post or inquiry data schemas.",
    "Implementing real-time updates or WebSocket-based refresh for admin stats.",
    "Modifying the community Feed or Profile pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}