{
  "kind": "build_request",
  "title": "Add PDF Download Button and Gemini-Powered Explore More Section",
  "projectName": "SafarX",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a 'Download PDF' button to the itinerary view (PlanTrip page / ItineraryTimeline component) that allows users to download their generated day-by-day itinerary as a formatted PDF file. The PDF should include the destination name, duration, travel style, and the full day-by-day activity breakdown.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "PDF download button"
        ]
      },
      "acceptanceCriteria": [
        "A clearly visible 'Download PDF' button appears on the itinerary results view after a trip plan is generated.",
        "Clicking the button triggers a PDF download in the user's browser.",
        "The downloaded PDF includes the destination, duration, travel style, and all day-by-day activities (Morning/Afternoon/Evening).",
        "The PDF is visually clean and readable, matching the SafarX brand aesthetic."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a Gemini-powered 'Explore More' section to the PlanTrip page that appears after a trip itinerary is generated. This section should use the Google Gemini API to fetch and display additional personalized travel suggestions, local tips, or hidden insights relevant to the selected destination and travel preferences.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Gemini-powered 'Explore More' section"
        ]
      },
      "acceptanceCriteria": [
        "An 'Explore More' section appears below the generated itinerary on the PlanTrip page.",
        "The section sends the selected destination, duration, travel style, and group type to the Gemini API and displays the response.",
        "A loading state is shown while the Gemini API call is in progress.",
        "If the API call fails, a graceful error message is shown without breaking the itinerary display.",
        "The section is styled consistently with the SafarX warm earthy design theme (saffron, terracotta, ivory, teal)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All Gemini API calls must be made from the frontend only — do not add backend endpoints for this feature.",
    "PDF generation must be handled entirely on the frontend (client-side) without any backend involvement."
  ],
  "nonGoals": [
    "Storing generated PDFs on the backend or in any database.",
    "Sending PDFs via email.",
    "Persisting Gemini API responses to the backend.",
    "Modifying the itinerary generation logic in itineraryGenerator.ts beyond what is needed to support these features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}