{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PDF Download Button and Gemini-Powered Explore More Section",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a 'Download PDF' button to the itinerary view that generates and downloads a formatted PDF of the user's day-by-day travel itinerary",
      "acceptanceCriteria": [
        "A clearly visible 'Download PDF' button appears on the itinerary results view after a trip plan is generated.",
        "Clicking the button triggers a PDF download in the user's browser.",
        "The downloaded PDF includes the destination, duration, travel style, and all day-by-day activities (Morning/Afternoon/Evening).",
        "The PDF is visually clean and readable, matching the SafarX brand aesthetic."
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add jsPDF library as a dependency for client-side PDF generation (e.g., \"jspdf\": \"^2.5.1\")"
        },
        {
          "path": "frontend/src/utils/pdfGenerator.ts",
          "operation": "create",
          "description": "Create a utility function that accepts an Itinerary object and generates a formatted PDF using jsPDF. Include the SafarX branding, destination name, duration, travel style, and all day-by-day activities (Morning/Afternoon/Evening). Apply a clean layout using the warm earthy color palette (saffron #F4A261, terracotta #E76F51, ivory #F8F4EC, teal #2A9D8F) and ensure the output is readable and professionally formatted."
        },
        {
          "path": "frontend/src/components/ItineraryTimeline.tsx",
          "operation": "modify",
          "description": "Add a 'Download PDF' button to the component's header section (positioned near the itinerary summary). Import and call the pdfGenerator utility function when the button is clicked, passing the current itinerary data. Style the button consistently with SafarX's design theme and ensure it is clearly visible after the itinerary is generated."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a Gemini-powered 'Explore More' section to the PlanTrip page that displays additional personalized travel suggestions after itinerary generation",
      "acceptanceCriteria": [
        "An 'Explore More' section appears below the generated itinerary on the PlanTrip page.",
        "The section sends the selected destination, duration, travel style, and group type to the Gemini API and displays the response.",
        "A loading state is shown while the Gemini API call is in progress.",
        "If the API call fails, a graceful error message is shown without breaking the itinerary display.",
        "The section is styled consistently with the SafarX warm earthy design theme (saffron, terracotta, ivory, teal)."
      ],
      "file_operations": [
        {
          "path": "frontend/.env.example",
          "operation": "modify",
          "description": "Add a new environment variable entry for the Gemini API key: VITE_GEMINI_API_KEY=your_gemini_api_key_here, with a comment explaining it is required for the Explore More feature."
        },
        {
          "path": "frontend/src/utils/geminiClient.ts",
          "operation": "create",
          "description": "Create a utility module that provides a function to call the Google Gemini API from the frontend. The function should accept destination, duration, travel style, and group type as parameters, construct a prompt requesting personalized travel suggestions and local tips, and return the API response. Include error handling for network failures and API errors. Use the VITE_GEMINI_API_KEY environment variable for authentication."
        },
        {
          "path": "frontend/src/components/ExploreMoreSection.tsx",
          "operation": "create",
          "description": "Create a new component that displays the Gemini-powered 'Explore More' section. Accept destination, duration, travel style, and group type as props. Use React Query (via @tanstack/react-query) to manage the Gemini API call state (loading, success, error). Display a loading spinner during the API call, show the suggestions on success, and display a graceful error message on failure without breaking the parent page. Style the section using SafarX's warm earthy color palette (saffron, terracotta, ivory, teal) and ensure it integrates seamlessly with the existing PlanTrip page design."
        },
        {
          "path": "frontend/src/pages/PlanTrip.tsx",
          "operation": "modify",
          "description": "Import and render the ExploreMoreSection component below the ItineraryTimeline component. Pass the selected destination, duration, travel style, and group type as props to ExploreMoreSection. Ensure the section only appears after a trip itinerary has been successfully generated."
        }
      ]
    }
  ]
}