{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Connect Identity / Google Sign-In button hidden behind header",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Fix the 'Connect Identity' / Google Sign-In button on the Community page and CommunityAuthModal so it is no longer obscured by the fixed site header by ensuring proper z-index stacking and modal positioning",
      "acceptanceCriteria": [
        "The Google Sign-In / Connect Identity button is fully visible and not overlapped by the site header on all screen sizes.",
        "The CommunityAuthModal dialog/panel renders above the fixed header (z-index higher than the header's stacking context).",
        "Clicking the Sign-In button is not blocked by the header element on desktop and mobile viewports.",
        "The modal overlay (if present) also sits above the header and covers the full viewport.",
        "No regression to header functionality or other modal/dialog components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Review the current z-index value used by the fixed header and document it. Ensure the header uses a consistent z-index value (e.g., z-40) that is lower than modal/dialog components. Do not modify the header's layout, navigation links, or scroll-aware background behavior per constraints."
        },
        {
          "path": "frontend/src/components/CommunityAuthModal.tsx",
          "operation": "modify",
          "description": "Update the modal dialog container and overlay to use a z-index higher than the header (z-50 or higher). Ensure the Google Sign-In button within the modal is not obscured by adding sufficient top padding or margin to account for the fixed header height. Verify that both the modal overlay and dialog content have proper z-index stacking to appear above all other page elements including the header."
        },
        {
          "path": "frontend/src/pages/Community.tsx",
          "operation": "modify",
          "description": "Ensure any inline auth panel or trigger button for the CommunityAuthModal on the Community page has appropriate z-index and positioning so it renders above the fixed header. Add proper spacing or offset from the top of the viewport to prevent overlap with the header on all screen sizes."
        }
      ]
    }
  ]
}