{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin dashboard: enquiries loading failure and community stats",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Debug and fix the admin dashboard enquiries fetch to ensure proper actor initialization guard, correct backend method name, and proper data mapping",
      "acceptanceCriteria": [
        "Opening /admin (while logged in) successfully fetches and displays all submitted enquiries without an error state.",
        "Each inquiry card shows name, email, phone, destination/travel interest, message, and submission timestamp.",
        "The Delete button on each card calls the correct backend delete function and removes the entry from the list on success.",
        "If no inquiries exist, a friendly empty-state message is shown instead of an error."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the `useInquiries` React Query hook to include an `enabled: !!actor` guard that prevents the query from firing before the actor is available. Verify that the backend method being called matches `getAllInquiries` from the backend interface. Ensure proper error handling and data type alignment with the `Inquiry` interface from backend.d.ts."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the Admin dashboard to properly handle the loading and error states from the `useInquiries` hook. Ensure the inquiry cards correctly map and display all fields (name, email, phone, destination, message, timestamp). Add a friendly empty-state message when no inquiries exist. Verify the delete functionality properly calls the backend and updates the UI on success."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Add React Query hooks for fetching community statistics and user list from the backend",
      "acceptanceCriteria": [
        "`useCommunityStats` hook returns `{ totalMembers, totalPosts }` from the backend.",
        "`useCommunityUserList` hook returns an array of `{ userId, username, displayName, joinedAt }` objects.",
        "Both hooks are exported from `useQueries.ts` and do not fire until the actor is available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add two new React Query hooks: `useCommunityStats` that calls `actor.getCommunityStats()` returning `{ totalMembers: bigint, totalPosts: bigint }`, and `useCommunityUserList` that calls `actor.getAllCommunityUsers()` returning an array of user objects with userId, username, displayName, and joinedAt fields. Both hooks must use the actor from `useActor`, include `enabled: !!actor` guards, and follow the same pattern as existing query hooks in the file. Export both hooks for use in components."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Add a Community Stats section to the Admin Dashboard displaying member count, post count, and a list of registered users",
      "acceptanceCriteria": [
        "Admin dashboard shows a 'Community Stats' section with total member count and total post count displayed as stat badges or summary cards.",
        "A list/table of all community users is rendered showing displayName and username for each user.",
        "Loading states show skeletons and error states show an inline error message rather than crashing the page.",
        "The community stats section is visually consistent with the warm-earthy SafarX.in theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Add a 'Community Stats' section below the enquiries list that uses the `useCommunityStats` and `useCommunityUserList` hooks. Display total members and total posts as stat cards with saffron/terracotta headings. Render a scrollable table or card list showing each user's displayName and username. Include loading skeletons while fetching (e.g., using shadcn/ui Skeleton components) and inline error messages on failure. Style consistently with the existing warm-earthy SafarX.in theme using ivory card backgrounds, saffron accents, and the site's typography."
        }
      ]
    }
  ]
}